app/Models/ModelAdmin.php

    public function Grafik()
    {
        return $this->db->table('tbl_rinci')
        ->join('tbl_jual', 'tbl_jual.no_faktur=tbl_rinci.no_faktur')
        ->where('month(tbl_jual.tgl_jual)', date('m'))
        ->where('year(tbl_jual.tgl_jual)', date('Y'))
        ->select('tbl_jual.tgl_jual')
        ->groupBy('tbl_jual.tgl_jual')
        ->selectSum('tbl_rinci.total_harga')
        ->selectSum('tbl_rinci.untung')
        ->get()->getResultArray();
---
SELECT `tbl_jual`.`tgl_jual`, SUM(`tbl_rinci`.`total_harga`) AS `total_harga`, SUM(`tbl_rinci`.`untung`) AS `untung`
FROM `tbl_rinci`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur`=`tbl_rinci`.`no_faktur`
WHERE month(tbl_jual.tgl_jual) = '02'
AND year(tbl_jual.tgl_jual) = '2024'
GROUP BY `tbl_jual`.`tgl_jual`